//*********************************************************
//File name :0504.c 
//Author   :邓宇航 
//Date    :2024年4月13日 
//Student ID   :2023216485 
//*********************************************************
#include <stdio.h>

int main(void)
{
	int a[10],i,b[2]={0,0},c[2]={0,0};
	
	for(i=0;i<10;i++)
	{
		scanf("%d",&a[i]);
	}
	
	for(i=0;i<10;i++)
	{
		if(a[i]>0)
		{
			b[0]++;
			c[0]+=a[i];
		}
		else if(a[i]<0)
		{
			b[1]++;
			c[1]+=a[i];
		}
	}
	
	printf("正数个数%d,正数之和%d,负数个数%d,负数之和%d",b[0],c[0],b[1],c[1]);
	return 0;
 } 
